app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 23) LIMIT 1