app/controllers/leagues_controller.rb

  def index
    @leagues = League.all
---
SELECT `leagues`.* FROM `leagues`

def load_league
  @league = League.find(params[:id])
---
SELECT `leagues`.* FROM `leagues` WHERE (`leagues`.`id` = 2) LIMIT 1