web/app/views/categories/show.html.haml

SELECT `leagues`.* FROM `leagues` WHERE (`leagues`.category_id = 43)
---
%ul
= @category.leagues.each do |league|